#%%
import pandas as pd
import pickle

#%%
# read excel data
res_dat_5 = pd.read_excel("rawdata/2024_5_res.xlsx")
res_dat_6 = pd.read_excel("rawdata/2024_6_res.xlsx")

# read pickle of desired data
with open('long_dict_6.pkl', 'rb') as handle:
    loaded_data = pickle.load(handle)
    

#%%
prep_dat_5 = (res_dat_5
            .melt(id_vars = "2024年5月当直表", value_name='name', var_name='tochoku')
            .dropna()
            .query("tochoku.isin(['D日直', 'E当直', 'F当直', 'A当直', 'B当直', '教育当直', '病棟当直'])")
            .groupby(["name", "tochoku"])["2024年5月当直表"]
            .apply(lambda x: ' ,'.join(x))
            .reset_index()
)

prep_dat_6 = (res_dat_6
            .melt(id_vars = "2024年6月当直表", value_name='name', var_name='tochoku')
            .dropna()
            .query("tochoku.isin(['D日直', 'E当直', 'F当直', 'A当直', 'B当直', '教育当直', '病棟当直'])")
            .groupby(["name", "tochoku"])["2024年6月当直表"]
            .apply(lambda x: ' ,'.join(x))
            .reset_index()
)
# %%

{'久冨木原': '久冨木原健二', 
 '伊藤(国)': '伊藤国秋', 
 '佐久川': '佐久川かれん', 
 '佐久間': '佐久間一也', 
 '佐川', '先崎', '勝俣', '吉村', '吉永',
       '吉田(博)', '吉田(心)', '大重', '太良', '小宮', '小林(洋)', '山田', '岡村', '岩崎',
       '川瀬', '平井', '持丸', '新美', '松井', '松原', '松永', '林(智)', '津山', '深沢', '熊木',
       '石井', '福井', '福原', '篠崎', '細川', '織部', '脇坂', '臼坂', '茅島', '荒金', '莇',
       '藤澤', '谷岡', '野上', '鈴木(徹)', '門松', '雪野', '青木', '高木', '高梨', '黒崎'}



['佐川\u3000偲', '入佐\u3000薫', '勝俣敬寛',
       '吉田博道', '吉田心慈', '大重達寛', '太良史郎', '安富大祐', '小林佐紀子', '小西美沙子', '山下博美',
       '岩崎文美', '川瀬\u3000咲', '持丸貴生', '東條誠也', '松井貴裕', '松原龍輔', '松永崇宏', '林智史',
       '津山\u3000頌章', '消化器内科\u3000\u3000福原\u3000誠一郎',
       '消化器内科\u3000渡邉\u3000多代', '清水\u3000隆之', '熊木聡美', '片山充哉',
       '石井\u3000真央', '福井梓穂', '福島龍貴', '篠﨑太郎', '籠尾壽哉', '糖尿病科岩瀬', '細川善弘',
       '織部\u3000峻太郎', '腎内\u3000門松', '腎臓内科\u3000松浦', '臼坂優希', '荒金直美', '莇舜平',
       '藤村 慶子', '藤澤まり', '谷岡友則', '里見\u3000良輔', '野上\u3000創生', '鈴木勝也',
       '長谷川華子', '雪野\u3000満', '髙木菜々美']


# %%
